app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hola"], ["user_id", 1], ["created_at", "2017-02-08 03:52:48.903742"], ["updated_at", "2017-02-08 03:52:48.903742"]]
---
  def create
      @post = Post.new(post_parms)
      @post.user_id = current_user.id
      respond_to do |f|
          if (@post.save)